In [9]:
import pandas as pd

In [10]:
df = pd.read_csv("data Transfromation.csv")

In [11]:
df

            Name   Age    Salary         City   Join Date
0    Alice Brown  25.0   $50,000     new york  05-03-2021
1      Raj Verma  30.0  55000USD     New York  05-03-2021
2      Sara Khan   NaN     60000  los angeles  08-03-2021
3  Charlie Smith  28.0       NaN     New york  05-03-2021
4    Alice Brown  25.0   $50,000     new york  05-03-2021

In [13]:
df["Age"] = df["Age"].fillna(df["Age"].mean())

In [14]:
df

            Name   Age    Salary         City   Join Date
0    Alice Brown  25.0   $50,000     new york  05-03-2021
1      Raj Verma  30.0  55000USD     New York  05-03-2021
2      Sara Khan  27.0     60000  los angeles  08-03-2021
3  Charlie Smith  28.0       NaN     New york  05-03-2021
4    Alice Brown  25.0   $50,000     new york  05-03-2021

In [16]:
df["Age"] = df["Age"].astype("int32")

In [17]:
df["City"] = df["City"].str.capitalize()

In [18]:
df["Join Date"] = pd.to_datetime(df["Join Date"])

In [19]:
df

            Name  Age    Salary         City  Join Date
0    Alice Brown   25   $50,000     New york 2021-05-03
1      Raj Verma   30  55000USD     New york 2021-05-03
2      Sara Khan   27     60000  Los angeles 2021-08-03
3  Charlie Smith   28       NaN     New york 2021-05-03
4    Alice Brown   25   $50,000     New york 2021-05-03